package utils.random.name;

/**
 * @ProjectName: wdkf-spring-boot-project
 * @Package: com.wdkf.wdkfspringbootutils.utils.random.name
 * @ClassName: ThirdName
 * @Description:
 * @Author: wangdehonga
 * @Date: 2020/8/28 18:07
 * @Version: 1.0
 */
public class ThirdName {

    /**
     * ThirdName
     */
    public static final String[] thirdname = {"壬","戌","之","秋","七","月","既","望","苏","子","与","客","泛","舟","游","于","赤","壁","之","下","清","风","徐","来","水","波","不","兴","举","酒","属","客","诵","明","月","之","诗","歌","窈","窕","之","章","少","焉","月","出","于","东","山","之","上","徘","徊","于","斗","牛","之","间","白","露","横","江","水","光","接","天","纵","一","苇","之","所","如","凌","万","顷","之","茫","然","浩","浩","乎","如","冯","虚","御","风","而","不","知","其","所","止","飘","飘","乎","如","遗","世","独","立","羽","化","而","登","仙","于","是","饮","酒","乐","甚","扣","舷","而","歌","之","歌","曰","桂","棹","兮","兰","桨","击","空","明","兮","溯","流","光","渺","渺","兮","予","怀","望","美","人","兮","天","一","方","客","有","吹","洞","箫","者","倚","歌","而","和","之","其","声","呜","呜","然","如","怨","如","慕","如","泣","如","诉","余","音","袅","袅","不","绝","如","缕","舞","幽","壑","之","潜","蛟","泣","孤","舟","之","嫠","妇","苏","子","愀","然","正","襟","危","坐","而","问","客","曰","何","为","其","然","也","客","曰","月","明","星","稀","乌","鹊","南","飞","此","非","曹","孟","德","之","诗","乎","西","望","夏","口","东","望","武","昌","山","川","相","缪","郁","乎","苍","苍","此","非","孟","德","之","困","于","周","郎","者","乎","方","其","破","荆","州","下","江","陵","顺","流","而","东","也","舳","舻","千","里","旌","旗","蔽","空","酾","酒","临","江","横","槊","赋","诗","固","一","世","之","雄","也","而","今","安","在","哉","况","吾","与","子","渔","樵","于","江","渚","之","上","侣","鱼","虾","而","友","麋","鹿","驾","一","叶","之","扁","舟","举","匏","樽","以","相","属","寄","蜉","蝣","于","天","地","渺","沧","海","之","一","粟","哀","吾","生","之","须","臾","羡","长","江","之","无","穷","挟","飞","仙","以","遨","游","抱","明","月","而","长","终","知","不","可","乎","骤","得","托","遗","响","于","悲","风","豫","章","故","郡","洪","都","新","府","星","分","翼","轸","地","接","衡","庐","襟","三","江","而","带","五","湖","控","蛮","荆","而","引","瓯","越","物","华","天","宝","龙","光","射","牛","斗","之","墟","人","杰","地","灵","徐","孺","下","陈","蕃","之","榻","雄","州","雾","列","俊","采","星","驰","台","隍","枕","夷","夏","之","交","宾","主","尽","东","南","之","美","都","督","阎","公","之","雅","望","棨","戟","遥","临","宇","文","新","州","之","懿","范","襜","帷","暂","驻","十","旬","休","假","胜","友","如","云","千","里","逢","迎","高","朋","满","座","腾","蛟","起","凤","孟","学","士","之","词","宗","紫","电","青","霜","王","将","军","之","武","库","家","君","作","宰","路","出","名","区","童","子","何","知","躬","逢","胜","饯"};
}
