package random.name;

/**
 * @ProjectName: wdkf-spring-boot-project
 * @Package: com.wdkf.wdkfspringbootutils.random.name
 * @ClassName: SecondName
 * @Description:
 * @Author: wangdehonga
 * @Date: 2020/8/28 18:06
 * @Version: 1.0
 */
public class SecondName {

    /**
     * SecondName
     */
    public static final String[] secondname = {"豫","章","故","郡","洪","都","新","府","星","分","翼","轸","地","接","衡","庐","襟","三","江","而","带","五","湖","控","蛮","荆","而","引","瓯","越","物","华","天","宝","龙","光","射","牛","斗","之","墟","人","杰","地","灵","徐","孺","下","陈","蕃","之","榻","雄","州","雾","列","俊","采","星","驰","台","隍","枕","夷","夏","之","交","宾","主","尽","东","南","之","美","都","督","阎","公","之","雅","望","棨","戟","遥","宇","文","新","州","之","懿","范","襜","帷","暂","驻","十","旬","休","假","胜","友","如","云","千","里","逢","迎","高","朋","满","座","腾","蛟","起","凤","孟","学","士","之","词","宗","紫","电","青","霜","王","将","军","之","武","库","家","君","作","宰","路","出","名","童","子","何","知","躬","逢","胜","饯","时","维","九","月","序","属","三","秋","潦","水","尽","而","寒","潭","清","烟","光","凝","而","暮","山","紫","俨","骖","騑","于","上","路","访","风","景","于","崇","阿","临","帝","子","之","长","洲","得","天","人","之","旧","馆","层","峦","耸","翠","上","出","重","霄","飞","阁","流","丹","下","临","无","地","鹤","汀","凫","渚","穷","岛","屿","之","萦","回","桂","殿","兰","宫","即","冈","峦","之","体","势","披","绣","闼","俯","雕","甍","山","原","旷","其","盈","视","川","泽","纡","其","骇","瞩","闾","阎","扑","地","钟","鸣","鼎","食","之","家","舸","舰","弥","津","青","雀","黄","龙","之","舳","云","销","雨","霁","彩","彻","区","明","落","霞","与","孤","鹜","齐","飞","秋","水","共","长","天","一","色","渔","舟","唱","晚","响","穷","彭","蠡","之","滨","雁","阵","惊","寒","声","断","衡","阳","之","浦","遥","襟","甫","畅","逸","兴","遄","飞","爽","籁","发","而","清","风","生","纤","歌","凝","而","白","云","遏","睢","园","绿","竹","气","凌","彭","泽","之","樽","邺","水","朱","华","光","照","临","川","之","笔","四","美","具","二","难","并","穷","睇","眄","于","中","天","极","娱","游","于","暇","日","天","高","地","迥","觉","宇","宙","之","无","穷","兴","尽","悲","来","识","盈","虚","之","有","数","望","长","安","于","日","下","目","吴","会","于","云","间","地","势","极","而","南","溟","深","天","柱","高","而","北","辰","远","关","山","难","越","谁","悲","失","路","之","人","萍","水","相","逢","尽","是","他","乡","之","客","怀","帝","阍","而","不","见","奉","宣","室","以","何","年"};
}
